Revit 2027 API
SketchEditScope.IsSketchEditingSupported Method
 Checks whether sketch can be edited.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSketchEditingSupported(
	ElementId sketchId
)
Public Function IsSketchEditingSupported (
	sketchId As ElementId
) As Boolean
public:
bool IsSketchEditingSupported(
	ElementId^ sketchId
)
member IsSketchEditingSupported :
        sketchId : ElementId -> bool
Parameters
sketchId ElementId
 The element id of sketch.
Return Value
Boolean
 True if sketch can be edited, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method checks if this particular sketch can be edited. If you want to check if all sketches of an element can be edited please use IsSketchEditingSupportedForSketchBasedElement(ElementId)
See Also
Reference
SketchEditScope Class
Autodesk.Revit.DB Namespace